{
    "recipes": [
        {
            "title": "Kimchi Sweet Potato Collard Wraps ",
            "time": "35 min",
            "ingredients": ["2 sweet potatoes, each cut into 6 wedges", "4 garlic cloves, minced", "4 oz cremini mushrooms, quartered", "6 oz collard greens, stems trimmed", "1 tbsp gochujang", "½ cup cashews, soaked in ⅓ cup warm water", "1 oz rice vinegar", "½ tbsp agave", "2.8 oz vegan cabbage kimchi, roughly chopped", "1 cucumber, cut into 2-inch sticks", "2 tbsp + 2 tsp vegetable oil*", "Salt and pepper*", "*Not included", "Ingredients are listed for 2 servings. If you're making 4 servings, please double your ingredients by using both meal kit bags provided.", "For full ingredient list, see Nutrition."],
            "steps": ["Preheat the oven to 425°F. Add sweet potato, just half the garlic, 2 tbsp vegetable oil, and a pinch of salt and pepper to a baking sheet, and toss. Roast in the oven for 15 minutes. Remove from the oven and move sweet potatoes to one side of the baking sheet. Add mushrooms, 2 tsp vegetable oil, and a pinch of salt and pepper to the other side of the baking sheet, and toss. Put baking sheet back in the oven and roast until sweet potatoes and mushrooms are tender and golden brown, another 10 to 12 minutes.(4-serving meal: use 4 tbsp vegetable oil, 4 tsp vegetable oil)", "Bring a large skillet with 2 inches salted water to a boil for the collard greens. Once the water is boiling, add the collard green leaves, and press to submerge. Cook until bright green and pliable, 1 to 2 minutes. Drain greens, rinse with cold water, and pat dry.", "Add remaining garlic, gochujang, cashews and soaking water, rice vinegar, and agave to a blender. Blend until smooth, scraping down the sides of the blender as necessary. Taste, and add salt and pepper as necessary. ", "Add kimchi and cucumber to a small bowl and toss to combine.", "Place 1 collard green leaves (or 2 if they’re small, allowing them to overlap) on a clean surface. Top with sweet potatoes, mushrooms, and cucumber kimchi. Roll, pressing to seal the wrap. Cut the roll in half. Repeat for the second roll.TIP: Don’t overstuff the wraps, as they will be difficult to roll.", "Divide the kimchi sweet potato collard wraps between plates. Serve any remaining spicy cashew dip, sweet potatoes, or cucumber kimchi on the side. Tuck in!"]
        },
        {
            "title": "Sesame Smashed Potato Skillet ",
            "time": "30 min",
            "ingredients": ["¾ cup red lentils, rinsed and sorted", "1 lemon, zested and juiced (divided)", "3 garlic cloves, minced (divided)", "1 tsp smoked paprika (divided)", "14 oz Yukon Gold potatoes", "1 oz red wine vinegar", "4 oz roasted red peppers, drained and roughly chopped", "½ oz fresh parsley, leaves and tender stems roughly chopped", "¼ cup vegan mayo", "1 tsp tuxedo sesame seeds", "1 tsp ground cumin", "2 oz baby kale", "3 tbsp olive oil*", "1 tbsp vegetable oil*", "Salt and pepper*", "Ingredients are listed for 2 servings. If you're making 4 servings, please double your ingredients by using both meal kit bags provided.", "For full ingredient list, see Nutrition."],
            "steps": ["Add red lentils to a small saucepan with 1¾ cups water and a pinch of salt. Bring to a boil, cover, reduce heat to low, and simmer until lentils are tender, 18 to 20 minutes. (The lentils should be very soft, almost the texture of hummus. If they start to dry out, add 2 tbsp warm water and stir.) Drain any remaining water and return lentils to the pot, off of the heat. Add just half the lemon juice, just half the garlic, just half the paprika, and 1 tbsp olive oil, and add a pinch of salt and pepper. Stir to combine, and cover to keep warm. (4-serving meal: use 3 ½ cups water, 2 tbsp olive oil)TIPS: To “sort” the lentils (as noted in the ingredient list) means to look for and discard any naturally occurring debris or stones.", "Add potatoes to a large pot, cover with 1 inch cold water, and bring to a boil. Cook until potatoes are fork-tender, 10 to 12 minutes. Drain and let cool.", "Add lemon zest, red wine vinegar, roasted red peppers, parsley, 2 tbsp olive oil and a  pinch of salt and pepper to a medium bowl, and stir the herbed pepper salsa.(4-serving meal: use 4 tbsp olive oil)", "Add mayo, ½  tsp lemon juice, remaining paprika, remaining garlic, and a pinch of salt to a small bowl and stir the paprika aioli. (4-serving meal: use 1 tsp lemon juice)", "Place cooled potatoes on a cutting board and use the palm of your hand to gently press each potato until the sides blister open. Heat 1 tbsp vegetable oil in a large skillet over medium heat. Add smashed potatoes and cook until golden brown and crispy, 3 to 5 minutes per side. Add sesame seeds, cumin and a pinch of salt and pepper, and cook until sesame seeds begin to toast and cumin becomes fragrant, 2 to 3 minutes. (4-serving meal: use 2 tbsp vegetable oil)", "Add baby kale, remaining lemon juice, and a pinch of salt directly to your cutting board, and toss. Divide the lentils between plates. Top with sesame smashed potatoes and baby kale. Drizzle with herbed pepper salsa and dollop with paprika aioli. Enjoy!"]
        }
    ]
}